  Выражения в C++ можно разделить на два типа:

	1. lvalue — выражения, значения которых являются ссылкой
на переменную/элемент массива, а значит могут быть
указаны слева от оператора =.

	2. rvalue — выражения, значения которых являются
временными и не соответствуют никакой
переменной/элементу массива
  
  Указатели и ссылки могут указывать только на lvalue

  	int a = 10 , b = 20;
  	int m [10] = {1 ,2 ,3 ,4 ,5 ,5 ,4 ,3 ,2 ,1};
	int & l1 = a ; // OK
	int & l2 = a + b ; // ошибка
    int & l3 = *( m + a / 2); // OK
    int & l4 = *( m + a / 2) + 1; // ошибка
    int & l5 = ( a + b > 10) ? a : b ; // OK
